{
  "sections": [
    {
      "title": "All Topics",
      "notes": [
        {
          "id": "1",
          "title": "Computer Science Introduction",
          "content": "===== 1 - Computer Science Introduction.pptx =====\n\n--- Slide 1 ---\nComputer Science\nIntroduction to Leaving Cert Computer Science\n- Ms Smyth\n\n--- Slide 2 ---\nThe 3 parts to Leaving Cert Computer Science\n\n--- Slide 3 ---\nComputer Science Learning Outcomes\nStrand 1:\n23 learnings Outcomes in Strand 1 (Practices and Principles)\n1.1 describe a systematic process for solving problems and making decisions\n1.2 explain how the power of computing enables different solutions to difficult problems\n……\nStrand 2:\n22 learnings Outcomes in Strand 2 (Core Concepts)\n2.1 use abstraction to describe systems and to explain the relationship between wholes and parts\nuse a range of methods for identifying patterns and abstract common features\n\n--- Slide 4 ---\nWhat will I study in computer science\n\n--- Slide 5 ---\nStrand 3 - Applied Learning Tasks ?\nStrand 3: Has 14 Learning Outcomes\n\n--- Slide 6 ---\nHow am I assessed in Leaving Cert Computer Science?\n\n--- Slide 7 ---\nThe Actual Leaving Certificate Exam – takes place in Late May\n",
          "file": "Notes/1 - Computer Science Introduction.pptx"
        },
        {
          "id": "2",
          "title": "Ethics & Computing",
          "content": "===== 2 - Ethics & Computing.pptx =====\n\n--- Slide 1 ---\nrelationship between computing technologies and society including issues of ethics\nLeaving Cert Computer Science\n\n--- Slide 2 ---\nLearning outcomes\n1.11 discuss the complex relationship between computing technologies and society including issues of ethics\n1.12 compare the positive and negative impacts of computing on culture and society\n\n--- Slide 3 ---\nCan you name some military inventions that have shaped our world, both positively or negatively?\nDARPA inventions\nthe positive and negative impact of military innovations on both society and technological developments\n\n--- Slide 4 ---\n1. Military innovations, including wartime inventions, have an overall positive impact on society and on technology.\n2. Military innovations, including wartime inventions, have an overall negative impact on society and on technology.\n3. Societies advance rapidly, from a technological point of view, when there is a strong military and especially during wartime.\nthe positive and negative impact of military innovations on both society and technological developments\n\n--- Slide 5 ---\nLearning outcomes\n1.11 discuss the complex relationship between computing technologies and society including issues of ethics\n1.12 compare the positive and negative impacts of computing on culture and society\n\n--- Slide 6 ---\nWhat is Ethics?\nmoral principles that govern a person's behaviour or the conducting of an activity.\nEthics is not a set of rules or laws.\nEthics are more personal and community held views about what is right or wrong.\nComputing and Ethics\n\n--- Slide 7 ---\nSelf-driving cars are already cruising the streets today. These cars will ultimately be safer and cleaner than their manual counterparts, they can’t completely avoid accidents altogether.\nHow should the car be programmed if it encounters an unavoidable accident?\nEthical Dilemma of Self Driving Cars\nComputing and Ethics / Self Driving Cars\n\n--- Slide 8 ---\na) Can robots or machines be programmed to be ethical?\nb) Do you believe it is preferable to hit an “old man” rather than a “female doctor”?\nd) Would these results be more useful if data was only collected in Ireland instead of worldwide? Should Irish data only be used to build cars for Irish roads?\nhttps://www.moralmachine.net/\nComputing and Ethics / Self Driving Cars\n",
          "file": "Notes/2 - Ethics & Computing.pptx"
        }
      ]
    },
    {
      "title": "Python Programming",
      "notes": [
        {
          "id": "9",
          "title": "Python Conditionals (If Statements)",
          "content": "Title: Python Conditionals (If Statements)\n\nKey Ideas:\n- If statements execute code only when a condition is true.\n- Use comparison operators (==, !=, >, <, >=, <=) to test conditions.\n- Indentation is required for code inside if statements.\n\nDefinitions:\n- If statement: Executes code only if a condition is true.\n- Condition: An expression that is either True or False.\n- Comparison operator: Symbols used to compare values (==, !=, >, <, etc.).\n\nProcesses/Steps:\n1. Write an if statement: if x > 5:\n2. Indent the code to run if the condition is true.\n3. Use else for code to run if the condition is false.\n4. Use elif for extra conditions.\n\nCommon Mistakes:\n- Forgetting the colon (:) after if, elif, or else.\n- Not indenting code inside the if block.\n- Using = instead of == for comparison.\n\nMini Check:\nQ1: What does 'if x == 3:' do?\nA1: Runs the code only if x equals 3.\nQ2: How do you check if two values are not equal?\nA2: Use !=.\n\nMemory Hook:\nIf statements are like checkpoints: If this is true, go this way!\n",
          "file": "Notes/9 - Python conditionals If.pptx"
        },
        {
          "id": "20",
          "title": "Python Functions & Recursion",
          "content": "Title: Python Functions & Recursion\n\nKey Ideas:\n- Functions group code for reuse and clarity.\n- Arguments are values passed into functions.\n- Functions can return values or just perform actions.\n- Recursion is when a function calls itself to solve a problem.\n\nDefinitions:\n- Function: A named block of code that performs a task.\n- Argument: A value given to a function.\n- Recursion: When a function calls itself.\n\nProcesses/Steps:\n1. Define a function with 'def'.\n2. Call the function by its name.\n3. Use arguments to pass data in.\n4. Use 'return' to send a value back.\n5. For recursion, always have a base case to stop.\n\nCommon Mistakes:\n- Forgetting to call the function.\n- Missing a base case in recursion (causes infinite calls).\n\nMini Check:\nQ1: What is a function?\nA1: A reusable block of code with a name.\nQ2: What is recursion?\nA2: When a function calls itself.\nQ3: Why is a base case important in recursion?\nA3: It stops the function from calling itself forever.\n\nMemory Hook:\nFunctions are like recipes: follow the steps and you get a result!\n",
          "file": "Notes/20 - PythonFunction&Recursion.pptx"
        }
      ]
    },
    {
      "title": "Web & Databases",
      "notes": [
        {
          "id": "21",
          "title": "HTML & CSS",
          "content": "**Slide 1:** HTML & CSS Leaving Certificate Computer Science\n\n**Slide 2:** Web Design & Development\u000bWhat will we cover in these classes? What is ‘The Web’ and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nBuilding a Classwork Portfolio Website. \nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 3:** What is the Internet? What is the World Wide Web? Are they the same thing? How do websites reach your screen? First, we will consider the following:\n\n**Slide 4:** The Internet The Internet is a global network, which allows computers to talk to each other. https://www.telstra.com.sg/content/dam/shared-component-assets/tecom/networks/global-networks/global-internet/hero-banner.jpg\n\n**Slide 5:** The Internet It requires hardware and software to operate and allows vast amounts of data to be transmitted over land and under oceans, from one side of the world to the other. Routers, switches and servers in millions of locations around the globe use over 300 underwater cables and countless cables above ground to connect to each other.\n\n**Slide 6:** The Internet If you were to put the underwater cables end to end, they would measure over half a million miles long. (That gets you to the moon and back with enough left over to wrap around the Earth three times!) All of this cabling, together with wireless networks, link thousands of data centres together, enabling data to be sent and received seamlessly around the world. https://i.pinimg.com/originals/03/62/25/036225b6f72d6dead644b958b1524d78.png\n\n**Slide 7:** The Internet The Internet dates back to 1969 when 2 computers, one at University of California and the other  at SRI International in California communicated with each other. Up until this times, computers generally did not share data with another computer, especially in real-time over a live connection. \n\nThe Internet now consists of billions of connected devices, all across the world. They are connected in many different ways e.g. copper wires, fibre optic cables, wireless satellites, microwave links and undersea cables. https://i.pinimg.com/originals/03/62/25/036225b6f72d6dead644b958b1524d78.png\n\n**Slide 8:** The Internet The computers connected on the internet are not just normal laptops and computers, but connected sensors and smart devices such as security cameras, TVs, cars and many other household appliances. This is called “The Internet of Things”\n\nWe can think of the internet as a network of connected computers i.e. the internet is the network https://i.pinimg.com/originals/03/62/25/036225b6f72d6dead644b958b1524d78.png\n\n**Slide 9:** The World Wide Web The World Wide Web (WWW) is an application that runs on the Internet. There are many applications and protocols operating on the Internet that provide the services we use every second of every day. For this class, it is not important to know how they all work but it is important to know that they are all individual applications working together to make, ‘the web’ work.\n\n**Slide 10:** The World Wide Web The World Wide Web (WWW) uses the Internet as a transmission medium. Without the Internet, the Web wouldn’t work.\n\nThe web was invented by Tim Berners-Lee in 1989. He created a way of putting websites onto the Internet. All these websites together are what is known as the World Wide Web.\n\nThink of the Web as a vast collection of documents (often HTML that represent web sites) with links to each other.\n\nThe web is only one use of the Internet. Other uses are email, instant messaging, streaming services etc\n\n**Slide 11:** Client Server Relationships When you visit a web page, your computer (the client) issues a request that eventually makes its way to the appropriate server.\n\nThe server is a computer that provides resources or services to other computers.\n\nThe server then carries out that request and the information representing the webpage/resources is transmitted back to your computer(the client)\n\nYour browser then renders the information received into the website you see.\n\n**Slide 12:** Client Server Relationships Client - Server Model\n\nThe WWW application uses the client-server model to communicate.\n\nThere are two sides in this model:\nServer (a device where data is stored)\nWeb Server\nEmail Server\n\nClient (the applications on our phones, tablets & computers)\nInternet Browser\nEmail Application\n\n**Slide 13:** Communication Protocols A communication protocol is a set of rules describing how to transmit data across a network. This network , can be the internet.\n\nThe client server model uses several different protocols, each governing communication in its own protocol layer of the network. Without these protocol (set of rules) the client server model would not work.\n\n**Slide 14:** The World Wide Web HTTP – Hyper Text Transfer Protocol\nHTTP is used to give users a way to interact with web resources, such as websites.\nMessages are transmitted between our phones or computers and the servers holding the information.\nWe request information from the server by entering the URL (website address) and the server returns the data in the form of a website to our client (phone, tablet, computer)\n\nHTTPS is the secure version which encrypts all traffic to and from the server.\nThis has allowed for secure banking and online shopping to become as popular as they are.\n\n**Slide 15:** The World Wide Web URL \nURL is an acronym for Uniform Resource Locator.\nIt is a reference to a resource on the Internet\nIt dictates the structure of the ‘web address’ that we type into a browser.\nEach valid URL points to a unique resource such as a HTML page, a CSS document, an image, etc.\n\n Note: A URL cannot contain spaces\n\n**Slide 16:** The World Wide Web DNS – Domain Name System\n\nDNS is a system that translates a website’s IP address to something we can more easily remember.\n\nIn the same way that we search for names in your contacts to save us having to remember hundreds of phone numbers, DNS allows us to remember the website’s name and not the unique IP address.\n\nWhat is easier to remember? 74.125.193.94\tor\twww.google.com\n\n**Slide 17:** The World Wide Web\n\n**Slide 18:** Client Server Relationships Client - Server Model\n\nFor this model it is critically important that the server is powered on and operating at all times. This is called High-Availability\n\nClients should be able to make a connection at any time, from anywhere and receive the data they request. The client does not need to be powered on 24/7 for the website to work properly.\n\n**Slide 19:** Summary You are now familiar with\n\nThe Internet\n\nThe World Wide Web\n\nThe Client Server Model\n\n**Slide 21:** Web Design & Development\u000bWhat will we cover in these classes? What is ‘The Web’ and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nBuilding a Classwork Portfolio Website. \nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 22:** How are websites made? HTML – Hyper Text Mark-up Language\n\nThe Web was created by Tim Berners-Lee whilst he was working at CERN.\n\nHe created the HTML language in 1991 whilst trying to find a better way to share information between sites, which until then relied on physically moving documents between sites or downloading entire documents when only a small portion of it was required.  HTML allowed researchers to simply click on a hyperlink and navigate to a different document and view the desired content.\n\nHTML revolutionised how information was shared, first at CERN and then globally once the first internet browsers were made available in the early 1990s\n\n**Slide 23:** How are websites made? HTML – Hyper Text Mark-up Language\n\nSince the first version of HTML was released in 1989, vast improvements have been made. We have come a long way from the initial “text only” websites to what we now see when browsing the web.\n\nImage tags were first used in 1993 allowing for images and photographs to be used on websites. Until this happened, the web was text only.\n\nCSS and Javascript became available in 1996. This enabled websites to be styled and become interactive\n\nHTML 5 was adopted in 2009, and is the current version being widely used.\n\n**Slide 24:** How are websites made? HTML is the basis on which everything on the web is built. Without it our computers would not know how to present the website on screen.\n\nCSS allows for the bare-bones, text only HTML websites to be styled and made more presentable. This enhances the experience for the user and ensures websites are presented well on small, mobile devices.\n\nJavascript enables users to interact with the website. The website can dynamically change based on your interaction with it thanks to Javascript.\n\n**Slide 25:** How are websites made? So what does HTML look like? Many different tags are used throughout a HTML document to produce text differently on screen.\n\nUsually, there will be a starting tag and a closing tag. In the example above <p> is the opening tag and </p> is the closing tag.\n\nThe text “Hello World” is the only thing that would be displayed on the screen in this example.\n\n**Slide 26:** How are websites made? <!DOCTYPE html>\u000b<html>\u000b<head>\u000b<title>Page Title</title>\u000b</head>\u000b<body>\u000b<h1>This is a heading</h1>\u000b<p>This is a paragraph.</p>\n<p>This is another paragraph.</p>\n</body>\u000b</html> Figure: HTML examples (https://www.w3schools.com/html/html_intro.asp) A closer look at a HTML document. Only the text in the <body> i.e. the white section will appear on screen. Everything else relates to the structure of the HTML document.\n\n**Slide 27:** How are websites made?\n\n**Slide 28:** Summary You have now seen how to display text on a webpage by\nAdding a h1 element to the body of a html file\nAdding a p element to the body of a html file\n\n**Slide 30:** Web Design & Development\u000bWhat will we cover in these classes? What is ‘The Web’ and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nBuilding a Classwork Portfolio Website. \nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 31:** HTML – Hyper Text Markup Language <!DOCTYPE html>\u000b<html>\u000b<head>\u000b  <title>Page Title</title>\u000b</head>\u000b<body>\u000b  <h1>This is a heading</h1>\u000b  <p>This is a paragraph.</p>\n <p>This is another paragraph.</p>\n</body>\u000b</html> Figure: HTML examples (https://www.w3schools.com/html/html_intro.asp) The language of the web Only the text in the <body> element, i.e. the white section above, will appear on the webpage. Everything else relates to the structure of the HTML document.\n\n**Slide 32:** HTML – Hyper Text Markup Language Figure: HTML examples (https://www.w3schools.com/html/html_intro.asp) The language of the web Only the text in the <body> element, i.e. the white section above, will appear on the webpage. Everything else relates to the structure of the HTML document.\n\n**Slide 33:** Review: What makes up a HTML element? Many different tags are used throughout a HTML document to produce text differently on screen.\n\nMost of the time there will be a starting tag and a closing tag.\n\nThe ‘element’ is the whole piece which contains\nOpening tag\nContent\nClosing tag\n\n**Slide 34:** Sections within HTML document There are four main sections of any HTML document that must exist for the webpage to operate correctly.\nThe <!DOCTYPE> declaration\nThe <html> element\nThe <head> element\nThe <body> element\n\nCan you identify each section in our Google example?\n\n**Slide 35:** <!DOCTYPE> tag <!DOCTYPE html> The <!DOCTYPE> declaration:\nRepresents the document type.\nHelps the browser display web pages correctly.\nMust only appear once, at the top of the HTML document, before any HTML tags.\nNot case sensitive.\n\nThe <!DOCTYPE> declaration for HTML5 is shown below.\n\n**Slide 36:** <html> tags The <html> & </html> tags:\nbookend the HTML document \n\nrepresent the root of the HTML document\n\nform a container for all other HTML elements, (with the exception of the <!DOCTYPE> tag) <!DOCTYPE html>\n\n<html>\n\u000b<head>\n  meta, title, link tags\n</head>\n\u000b<body>\n  <h1> Heading 1 </h1>\n  <h2> Heading 2 </h2>\n  <h3> Heading 3 </h3>\n  <h4> Heading 4 </h4>\n  <h5> Heading 5 </h5>\n  <h6> Heading 6 </h6>\n</body>\n\u000b</html>\n\n**Slide 37:** <head> tags The <head> & </head> tags contain the metadata for the HTML document.\n\nMetadata is data about the HTML document.\n\nMetadata typically define the \ndocument title\ncharacter set\nstyles\nscripts <!DOCTYPE html>\n<html>\n\n <head>\n\n   <meta charset=\"utf-8\">\n   <meta name=\"viewport“ content=\"width=device-width\">\n   <title>repl.it</title>\n   <link href=\"style.css\" rel=\"stylesheet\" type=\"text/css\" />\n\n </head>\n\u000b <body>\n   webpage content\n </body>\n\n</html>\n\n**Slide 38:** <head> tags Some of the common elements that are included within the head tag include:\n\n<title>: This element is used to define the title of the document, which is displayed in the browser's title bar and is often used by search engines to describe the page.\n\n<meta>: This element is used to define metadata about the document, such as the character encoding, description of the page, keywords, and author.\n\n<link>: This element is used to link to external resources, such as stylesheets or scripts, that are used to format or enhance the page.\n\n<script>: This element is used to define JavaScript code that is executed on the page.\n\n**Slide 39:** Example of a head tag: In this example, the code specifies the character set, sets the page title to \"My Awesome Website,\" provides a brief description of the website, lists some keywords that describe the content, and includes a link to a CSS stylesheet that controls the page's styling.\n\n**Slide 40:** <body> tags The <body> & </body> tags define the document’s body section.\n\nThe <body> element contains all of the content of the HTML document.\nheadings\nparagraphs\nimages\nhyperlinks\nlists\n\nThere can only be one <body> element in a HTML document. <!DOCTYPE html>\n<html>\n  <head>\n    meta, title, link tags\n  </head>\n\u000b  <body>\n    <h1> Heading 1 </h1>\n    <h2> Heading 2 </h2>\n    <p> paragraph 1 </p>\n    <p> paragraph 2 </p>\n    <img src=\"image.jpg\">\n    <a href=\"https://www.csinc.ie\">This is a link</a>\n    <ol> ordered list\n      <li> list item </li>\n    </ol>\n  </body>\n\n</html>\n\n**Slide 41:** Heading tags HTML headings are defined using the following opening and closing tags:\n\n<h1>\t</h1>\t Most Important heading. Largest.\n<h2>\t</h2>\n<h3>\t</h3>\n<h4>\t</h4>\n<h5>\t</h5>\n<h6>\t</h6>\t Least Important heading. Smallest. So what does this look like?\n\n**Slide 42:** Heading tags <body>\n\t<h1> Heading 1 </h1>\n\t<h2> Heading 2 </h2>\n\t<h3> Heading 3 </h3>\n\t<h4> Heading 4 </h4>\n\t<h5> Heading 5 </h5>\n\t<h6> Heading 6 </h6>\n</body>\n\n**Slide 43:** Paragraph tags What do they look like in real life? <body>\n  <h1> HTML </h1>\n  <h2> Paragraph tags </h2>\n  <p> Typically, most of the content you read on websites are contained within paragraph tags as they allow for a lot of text to be displayed in an easy to read format. </p>\n  <p> If all text was contained in heading tags then it would be very difficult to make websites look nice. </p>\n</body>\n\n**Slide 44:** Lists We use lists every day of our lives and they come in all shapes and sizes.\nClass timetable\nTV channel listing\nApp download charts\nShopping list\nRecipe\n\nThere are two types of lists though and we don’t tend think about that every time we use them.\nUnordered lists\nOrdered lists\n\nWhen do we use each one?\nDoes it matter what order we buy the items for a recipe when shopping?\nDoes it matter what order we prepare and cook them when using the recipe?\n\n**Slide 45:** Unordered Lists <body>\n  <h2> Car Manufacturers & Models  </h2>\n    <ul>\n      <li> Ford Focus </li>\n      <li> Volkswagon Tiguan </li>\n      <li> Hyundai Tuscon </li>\n      <li> Toyota Corolla </li>\n      <li> Hyundai Kona </li>\n      <li> Volkswagon Golf </li>\n      <li> Toyota Yaris </li>\n      <li> Skoda Octavia </li>\n      <li> Nissan Qashqai </li>\n      <li> Toyota C-HR </li>\n    </ul>\n</body>\n\n**Slide 46:** Ordered Lists <body>\n  <h2> Top 10 Car Manufacturers & Models Sold in Ireland in 2019 </h2>\n    <ol>\n      <li> Toyota Corolla </li>\n      <li> Nissan Qashqai </li>\n      <li> Hyundai Tuscon </li>\n      <li> Volkswagon Golf </li>\n      <li> Skoda Octavia </li>\n      <li> Volkswagon Tiguan </li>\n      <li> Hyundai Kona </li>\n      <li> Ford Focus </li>\n      <li> Toyota Yaris </li>\n      <li> Toyota C-HR </li>\n    </ol>\n</body>\n\n**Slide 47:** Summary You are now familiar with\nThe structure of every HTML 5 document\nAdding text to a webpage using paragraph and heading tags\nCreating unordered lists and adding list items to the list\nCreating ordered lists and adding list items to the list\n\n**Slide 49:** What will we cover in this class? Hyperlinks\nWhat are they?\nHow do they work?\nLinking to other pages in our website\nLinking to external websites Images\nWhy are images important?\nUsing the images folder\nInserting images into our webpages\n\n**Slide 50:** Why use images in HTML? There’s a big difference in a website that is heavily text based and a website that has a good blend of imagery and text.\n\nText heavy websites have their place and suit certain purposes (Wikipedia for example)\n\nHowever, most people would be put off from browsing text based websites for fun, or for a long period of time.\n\nWhilst Wikipedia articles will provide you with useful information, they don’t tend to grab your attention or keep you engaged.\n\nLet’s look at how important good use of imagery is within HTML. Image Source:  https://pixabay.comImage\n\n**Slide 51:** Why use images in HTML? Whilst the Wikipedia article below will provide you with useful information, it doesn’t grab your attention.\nThe links require you to read them to know what you are clicking towards.\n\n**Slide 52:** Why use images in HTML? News sites such as The Journal or The 42 use images within each news headline to help the reader immediately know what the content is about and to also draw the reader’s attention to specific articles of interest to them.\n\n**Slide 53:** Effective use of images. What webpage is more likely to grab your attention and make you click the link to hopefully spend money?\n\nThis one?\n\n**Slide 54:** Effective use of images. Or this one?\n\n**Slide 55:** Using images in HTML Best practice is to have an “images” folder where all images contained on the website are housed.\n\nSub folders for each webpage can be created within the images folder if required.\nThis allows for \nbetter management of a large number of files\nefficient movement between servers during upgrades\n\nThe next slide reminds you how to create the images folder in Repl.it\n\nWe will then look at implementing the <img> tag and displaying an image on screen.\n\n**Slide 56:** Using the images folder in Repl.it Navigate to Repl.it and log in to the account you created in the first class.\n\nCreate a new Repl, select HTML 5 as the language and name it “Class 3 – Images”.\n\nOn the left hand menu, click the Add Folder button.\n\nClick Add Folder.\n\nName the folder images and hit the return key.\n\nDownload the sample images from the folder in the Class 3 section of Moodle.\n\nOpen your browser window and then open the folder where the images downloaded to.\n\nHighlight the images and click and drag them into the images folder.\n\nPlease use the video tutorial detailing this process if you need assistance – 3.8 Images Folder Tutorial\n\n**Slide 57:** Using images in HTML The image element <img> is unlike the other tags and elements we have looked at so far as it does not require a closing tag.\n\nIt has three components\nThe image tag\n\nThe source attribute\n\nThe alt attribute\n\n\n\nLet’s see how it looks in action. <img src=\"images/CSinc.png\" alt=\"CS Inc logo\">\n\n**Slide 58:** Using images in HTML <!DOCTYPE html>\n<html>\n  <head>\n  <meta charset=\"utf-8\">\n  <meta name=\"viewport\" content=\"width=device-width\">\n  <title>Using Images</title>\n  <link href=\"style.css\" rel=\"stylesheet\" type=\"text/css\" />\n</head>\n<body>\n  <h2> Using images in HTML </h2>\n  <h3> What makes up the image element? </h3>\n\n  <img src=\"images/CSinc.png\" alt=\"CS Inc logo\">\n\n</body>\n</html>\n\n**Slide 59:** Using images in HTML If we break down the line of code relating to the image, we can clearly see the three components we saw in the previous slide.\n\n\n<img src=\"images/CSinc.png\" alt=\"CS Inc logo\">\n\nThe image tag                          <img            >\n\nThe source attribute               src=\"images/CSinc.png\" \n\nThe alt attribute                      alt=\"CS Inc logo\">\n\n\nThis is the basis for inserting any image into any HTML document.\n\n**Slide 60:** The source attribute <img src=\"images/CSinc.png\" alt=\"CS Inc logo\">\n\nThe source attribute               src=\"images/CSinc.png\" \n\nIf you run into problems displaying an image on your webpage, it is highly likely that the source attribute is incorrect.\n\nIf we break down the code in the example above, we can see that we are linking the source attribute to \nThe ‘images’ sub-folder\nA file called ‘CSinc.png’\n\nIf we linked to Csinc.png or Csinc.jpg or images\\Csinc.png then no image would be displayed.\n\nIt is essential that the filename is identical to the filename stored in the images folder.\n\n**Slide 61:** The alt attribute <img src=\"images/CSinc.png\" alt=\"CS Inc logo\">\n\nThe alt attribute               alt=\"CS Inc logo\"\n\nThe alt attribute allows you to enter alternate text describing the image. You can see we are telling the user that the CS Inc logo is being displayed.\n\nThis is used for images that won’t load due to a bad internet connection, an error in the source attribute or for users that use a screen reader.\n\nSearch engines also look favourably on websites that use the alt attributes correctly and rank the website higher as a result. \nThis falls into an aspect of the web called Search Engine Optimisation (SEO) but is outside the scope of this course.\n\n**Slide 62:** Summary You are now familiar with \n\nStoring any picture files in an images folder\n\nUsing the <img> tag with the src and alt attributes to add an image to your webpage\n\n**Slide 64:** The Web\u000bWhat will we cover in these classes? What is it and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nEmbedding code within webpages\nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 65:** Review: What did we cover in the last class?\n\n**Slide 66:** What will we cover in this class? Hyperlinks\nWhat are they?\nHow do they work?\nLinking to other pages in our website\nLinking to external websites Images\nWhy are images important?\nUsing the images folder\nInserting images into our webpages\n\n**Slide 67:** Hyperlinks - What are they? Hyperlinks are links that are embedded in the text of a webpage that allow you to click on them and navigate to:\na different part of the webpage you’re on (not covered in this class)\na new page within the website you’re visiting\na new website entirely.\n\n**Slide 68:** Hyperlinks - What are they? Without the ability to easily jump between pages or websites, the web would never have become what it is today. \n\nThe manual entering of URLs or scrolling through large webpages to find a particular section would prevent most people from using it.\n\nSo how do we create them?\n\n**Slide 69:** Hyperlinks – How do they work? The source is the text, image, or button that links to another resource.\nThe blue hyperlinks link in the example below. The destination is the resource that the source anchor links to.\nThe http://www.csinc.ie link in the example below. <h2> Hyperlinks </h2>\n\u000b<p> This is what \n<a href=\"http://www.csinc.ie\"> hyperlinks </a> look like on webpages. </p> The <a> tag defines a hyperlink. The href attribute specifies the URL of the page the link goes to:\n<a href=\"https://www.w3schools.com\">Visit W3Schools</a>\n\n**Slide 70:** Hyperlinks – Let’s break them down The anchor element uses an opening and closing tag.\nThe opening tag <a> incorporates the destination link\nThe closing tag </a> is essential and its location is very important. \nIt should be placed directly after the text you want to be ‘clickable’ otherwise the link will use the rest of the text on the page until it appears.\n\nhref stands for ‘hyperlink reference’ and is where you set the URL or page name you want to direct the user to.\n\nTwo examples of anchor tags applied in different locations of the HTML document are shown on the next slides. Both of them direct the user to a new website. <a href=\"http://www.csinc.ie\"> hyperlinks </a>\n\n**Slide 71:** Hyperlinks – linking to a new website HTML containing anchor tags at the start of a paragraph. <h2> Hyperlink examples in different locations </h2>\n\u000b<p> <a href=\"http://www.google.ie\"> Google</a> is a search engine that allows us to enter search terms and find millions of websites containing information relating to that term. </p> Hyperlink on webpage.\n\n**Slide 72:** Hyperlinks – linking to a new website HTML containing anchor tags in the middle of a paragraph. <h2> Hyperlink examples in different locations </h2>\n\u000b<p> If I wanted to check the weather forecast, I would use the \n<a href=\"http://www.met.ie\"> Met Eireann</a> website to see if I should bring an umbrella or leave it at home. </p> Hyperlink on webpage.\n\n**Slide 73:** Hyperlinks – linking internally We don’t always have to link to a new website and leave the one we are already on. \n\nMaybe we want to find out some information relating to the website we are on such as, contact details for a department or directions to a particular building.\n\nIn this case, we don’t use a URL in our source anchor tag for a different website, we use the page name for the relevant page on our website.\n\nIn Repl, we can create new HTML pages, enter new content and link to them from the index.html page we set up a few weeks ago.\n\nThis allows us to create a website containing multiple pages, have different content on each page and link between them. This leads to a much better user experience (also known as UX).\n\n**Slide 74:** Hyperlinks – linking internally In Task 1 we will step through how to add pages and link between them.\nFor now you can see the example below showing two HTML pages. The image below shows our index page with a link to the Contact Us page. Let’s click it.\n\n**Slide 75:** Hyperlinks – linking internally We are brought to the Contact Us page of the website, which is shown on the right.\n\nThe HTML code making up this page is shown on the left.\n\nThe structure is the very same. The only difference is the <body> section containing the content to be displayed.\n\n**Slide 76:** Recap Hyperlinks allow us to link to a new page or new website entirely.\n\nThey require a source anchor and destination anchor to be specified.\n\nThey appear as clickable text within the webpage.\n\nThey can also be embedded into images to create a clickable image that will bring us to the new page or website.\n\n\n\nLet’s look at how to uses images in HTML now.\n\n**Slide 77:** The Web\u000bWhat will we cover in these classes? What is it and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nEmbedding code within webpages\nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 78:** Summary You are now familiar with\n\nUsing the <a> anchor tag so create a hyperlink to another website\n\nUsing the <a> anchor tag so create a hyperlink to another webpage in the current website\n\n**Slide 80:** The Web\u000bWhat will we cover in these classes? What is it and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nEmbedding code within webpages\nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 81:** Review: What did we cover in the HTML classes?\n\n**Slide 82:** What will we cover in this class? CSS\nWhat is it?\nWhat does it do?\nHow does it work?\nWhat can we change?\nWhat does it look like?\n\nWays to implement CSS\n\nUsing CSS\nElements\nSyntax\nSelectors\n\n**Slide 83:** CSS – What is it? CSS stands for Cascading Style Sheets. It is a method used to style websites.\n\nCSS is used to change aspects of HTML documents such as background colour, font colour, font size & page layout.\n\nCSS controls how HTML elements are displayed within webpage and websites.\n\nIt allows us to define the overall design and layout of our webpages and to cater them for use on devices with different screen sizes.\n\nIt also allows for easy and efficient styling of multiple web pages, all at once.\n\nWe should remember\nHTML dictates the structure\nCSS dictates the design\n\n**Slide 84:** CSS – What is it? The cascade in the name, “Cascading Style Sheets” describes the order in which styling is applied. \nThere may be no styling implemented, in which case the browser applies some default styling, or, at the other end of the scale, there may be very specific styling applied to some HTML elements. In this case the HTML attribute styling will override the styling applied before it.\n\nIf we look at this diagram, from the top down, we can see the order in which styling will be applied to the HTML document.\n\nThe default settings of the browser\nExternal Style Sheets\nEmbedded Styles\nInline Styling (The type we will look at today)\nHTML attribute styling\n\n**Slide 85:** CSS – What can we change? Some things that we can change by implementing CSS styling are listed below. \n Note: It is not a full list by any means. \n\nAll elements of a webpage can be styled and manipulated, we will look at some basic styling in this class.\n\nFont family\nFont size\nFont colour\nBackground colour\nImage size\nImage position\nText position\n\n**Slide 86:** CSS – What does it do? CSS allows us to turn the webpages we have been creating into more visually appealing versions of themselves by \nIntroducing font styling, \nChanging the layout of the page\nMaking the webpage responsive to screens of different sizes.\n\nThe next few slides show how differently a webpage can be styled, just by changing the CSS applied to it. \n\nThe content of the HTML document is the same in all examples. All that has changed is the CSS styling.\n\nYou can visit the link below to use the interactive example and find more information.\n\nhttps://www.w3schools.com/css/css_intro.asp\n\n**Slide 87:** CSS – Webpage – No CSS applied.\n\n**Slide 88:** Sample Webpage Styled with CSS\n\n**Slide 89:** Sample Webpage Styled with CSS\n\n**Slide 90:** Sample Webpage Styled with CSS\n\n**Slide 91:** Sample Webpage Styled with CSS\n\n**Slide 92:** CSS – So how does it work? The rules that describe the styling to be applied are made up of two parts\nSelectors\nDeclarations\n\nWe choose the element to be styled by entering it is the Selector field.\nThe example below shows the entire body section being chosen.\n\nWe then choose the property and value to be applied to it.\nThe example shows the property: color being chosen and the value: blue being applied to it.\n\n\n\n\n\n Note: Pay attention to the spelling of the word color when using it.\n\n**Slide 93:** CSS – How do we use it? In this class we will look at Inline Styling and how to implement it.\n\nThe syntax (arrangement of the various parts), for inline styling is shown below. \n\nWhen using Inline Styling, we add the styling directly to the opening HTML tag itself, so it is specifically applied to the content of that tag and that tag only.\n\nIf any styling had been applied before this, we would be over-riding it by applying this inline styling.\n<p style=\"color: blue; font-size: 46px;\">\n\nIn this example we are: \n\tStyling a paragraph element\n\tColouring it blue\n\t\tChanging the font size to 46 pixels\n\n**Slide 94:** CSS – How do we use it? <p style=\"color: blue; font-size: 46px;\"> Insert content here </p>\n\nThe code displayed above shows the full element containing the opening HTML tag (with inline CSS styling applied), the content and the closing tag.\n\nThe styling is applied in the opening tag only and multiple style attributes are separated by semi-commas.\n\n**Slide 95:** Inline Styling In this class, we will only use inline styling to make changes to our HTML documents. \nWe will look at external style sheets in the next class.\nTo look at Inline Styling in action, in more than one element, we will use the basic HTML code from Class 1 – Task 2 and change the text colour  \n\n\nFrom this:\n\n\n\n\n\nTo this:\n\n**Slide 96:** Inline Styling <!DOCTYPEhtml>\n<html>\n  <head>\n  <metacharset=\"utf-8\">\n  <metaname=\"viewport\"content=\"width=device-width\">\n  <title>The Web & HTML</title>\n  <linkhref=\"style.css\"rel=\"stylesheet\"type=\"text/css\"/>\n</head>\n<body>\n  <scriptsrc=\"script.js\"></script>\n  <h1>The Web & HTML </h1>\n  <h2>CS Inc - Transition Year </h2>\n  <h3>In this class we have learned how The Web works and how websites reach our screens.</h3>\n  <p>We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n  </body>\n</html> We will use the code below to apply some inline styling\n\nBefore moving on, what four items do we need to apply the styling to?\n\n**Slide 97:** Inline Styling <h1>The Web & HTML </h1>\n<h2>CS Inc - Transition Year </h2>\n<h3>In this class we have learned how The Web works and how websites reach our screens.</h3>\n\n<p>We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n\n</body>\n</html> To change the colours to match the example we need to add inline styling to the \n<h1>\n<h2>\n<h3> \nand second <p> element (shown below).\n\n**Slide 98:** Inline Styling <h1>The Web & HTML </h1>\n<h2>CS Inc - Transition Year </h2>\n<h3>In this class we have learned how The Web works and how websites reach our screens.</h3>\n\n<p>We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n\n</body>\n</html> Elements to style:\n<h1>\n<h2>\n<h3> \nand second <p> element.\n\n**Slide 99:** Inline Styling <h1 style=\"color:blue\">The Web & HTML </h1>\n<h2>CS Inc - Transition Year </h2>\n<h3>In this class we have learned how The Web works and how websites reach our screens.</h3>\n\n<p>We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n\n</body>\n</html> Elements to style:\n<h1 style=“color:blue;”>\n<h2>\n<h3> \n<p>\n\n**Slide 100:** Inline Styling <h1 style=\"color:blue\">The Web & HTML </h1>\n<h2 style=\"color:red;\">CS Inc - Transition Year </h2>\n<h3>In this class we have learned how The Web works and how websites reach our screens.</h3>\n\n<p>We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n\n</body>\n</html> Elements to style:\n<h1 style=“color:blue;”>\n<h2 style=“color:red;”>\n<h3> \n<p>\n\n**Slide 101:** Inline Styling <h1 style=\"color:blue\">The Web & HTML </h1>\n<h2 style=\"color:red;\">CS Inc - Transition Year </h2>\n<h3 style=\"color:pink;\">In this class we have learned how The Web works and how websites reach our screens.\n</h3>\n<p>We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n</body>\n</html> Elements to style:\n<h1 style=“color:blue;”>\n<h2 style=“color:red;”>\n<h3 style=“color:pink;”> \n<p>\n\n**Slide 102:** Inline Styling <h1 style=\"color:blue\">The Web & HTML </h1>\n<h2 style=\"color:red;\">CS Inc - Transition Year </h2>\n<h3 style=\"color:pink;\">In this class we have learned how The Web works and how websites reach our screens.</h3>\n<p style =\"color:green;\">We have also learned that websites are built from HTML files and in the next class will look at creating our own webpage. </p>\n\n</body>\n</html> Elements to style:\n<h1 style=“color:blue;”>\n<h2 style=“color:red;”>\n<h3 style=“color:pink;”> \n<p style=“color:green;”>\n\n**Slide 103:** The Web\u000bWhat’s next? What is it and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nEmbedding code within webpages\nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 104:** Summary You are now familiar with\nWhat CSS is used for\nUsing inline styling to change the colour of text on a webpage\n\n**Slide 106:** The Web\u000bWhat will we cover in these classes? What is it and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nEmbedding code within webpages\nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 107:** Review: \u000bWhat did we cover in the last class? CSS\nWhat is it?\nWhat does it do?\nHow do we use it?\n\nInline Styling\nStyling individual elements\n\n**Slide 108:** What will we cover in this class? External Style Sheets\nTheir benefits over Inline Styling\nHow they work\nHow to use them\n\nNavigation Bar\nHow important they are for good UX\nHow to implement them within our HTML pages.\n\n**Slide 109:** CSS – External Style Sheets In the last class we saw how we can style individual HTML elements to change their colour, font, font size, positioning, etc.\n\nIf we wanted to style 100 elements using inline styling, we would need to insert the CSS inline style coding 100 times in 100 different locations. \n\nKeeping track of where the changes would be needed would be a job in itself.\n\nThis is where External Style Sheets come in to make life much easier when styling entire websites. One change within an external style sheet can affect the 100 elements throughout the website in one go. This makes it a much more efficient way to manage the styling of a website.\n\nSo how do they work?\n\n**Slide 110:** CSS – External Style Sheets Instead of adding code within the individual elements of our website, an external style sheet file is used to store all of the various stylings for each section of the HTML document.\n\nThere are many benefits to this approach: \t\nIt makes the HTML document easier to read as there is less code to read.\nIt is a more efficient way of making changes to multiple webpages throughout a website.\nIt allows for larger websites to be maintained more easily.\nThe speed of the pages loading increases once the stylesheet has been loaded to memory.\n\n**Slide 111:** CSS – External Style Sheets Remember when we said to forget the style.css file in Class 1 until a later class?\nStop forgetting it. It’s time to look at it now!\n\nIn the <head> section of our HTML document we have seen the code below appearing each time we load up a new session. \n\n<link href=\"style.css\" rel=\"stylesheet\" type=\"text/css\" />\n\nThis line of code shows the HTML document linking to the external style sheet \"style.css\"\n\nOnce this is in place (and a style.css file exists) we can focus on building:\nthe structure within the various .html files\nthe styling for them within the .css file.\n\nNote: The file can be called whatever you want provided it has .css after it. style.css is what we will use in these classes.\n\n**Slide 112:** CSS – External Style Sheets External style sheets should contain styling for each element of the HTML files that you wish to style\nbody {\u000b  background-color: lightblue;\u000b}\u000b\u000bh1 {\u000b  color: navy;\u000b  margin-left: 20px;\u000b} \nIn the example above, the style sheet contains styling for the <body> and <h1> sections.\nThe background of all webpages that are linked to this style sheet will be light blue and \nThe <h1> headings will have navy text with a margin from the left of 20 pixels.\n\nYou must ensure that the attributes you want to style are contained { within the brackets }\n\n**Slide 113:** CSS – External Style Sheets No styling entered in the style.css file:\n\n**Slide 114:** CSS – External Style Sheets The styling from our previous example is entered in the style.css file:\n\n\n\n\n\n\n\n\n\nThe background colour is light blue\nThe heading colour is navy\nThe heading is moved in from the left\n\n**Slide 115:** CSS – Navigation between pages What have we covered so far?\n\nWe can create webpages using HTML containing text, images and links to make websites. \n\nWe can style these webpages using CSS, whether it is within each element or from an external style sheet.\n\nWhat we need now is a way to navigate between these webpages easily.\n\nThat is where nav bars come in.\n\n**Slide 116:** CSS – Navigation Bars We need to add a new section to our HTML documents to use a nav bar.\nIt needs to be added to all webpages that you want it to appear on.\n\nIn the body section we will add the code below:\n<nav>\n<a href=\"index.html\">Page1</a>\n<a href=\"page2.html\">Page2</a>\n<a href=\"page3.html\">Page3</a>\n<a href=\"page4.html\">Page4</a>\n</nav>\n\t\nIn the new <nav> section, we have four anchor links with each one linking to a different webpage.\nThe text before the closing tag (Page1, Page2, Page3, Page4 in our example) is what will appear in the nav bar on screen.\nLet’s see what it all looks like in action.\n\n**Slide 117:** CSS – Navigation Bars We have added three new .html files for the new webpages (page2.html, page3.html & page4.html).\nEach page is linked correctly within the nav section.\nWe can see a basic nav bar at the top of each webpage to allow us reach each page.\n Note: The CSS for the nav section is on the next slide.\n\n**Slide 118:** CSS – Navigation Bars /* Add a grey background colour to the top nav bar */\nnav{\nbackground-color: grey;\n}\n\u000b/* Style the links inside the nav bar */\nnav a {\nfloat: top;\ncolor: #f2f2f2;\ntext-align: center;\npadding: 14px 16px;\ntext-decoration: none;\nfont-size: 18px;\n}\n\u000b/* Change the colour of links on hover */\nnav a:hover {\nbackground-color: #ddd;\ncolor: black;\n} /* Add a grey background colour to the top nav bar */\nThis code dictates the colour applied to the entire nav bar.\n\n\n\u000b/* Style the links inside the nav bar */\nThis code affects the individual nav buttons\nIt fixes it at the top of the screen, centrally aligned and coloured a light grey.\nThere is some padding used to space them more evenly and the font size is slightly smaller than the header font size at 18px\n\n\n\n/* Change the colour of links on hover */\nThis code affects what happens when the mouse cursor moves over each nav button.\nWhen the cursor moves over each button, it changes the background colour to a lighter grey and changes the text colour to black.\n\n**Slide 119:** Summary You are now familiar with \nAdding styling in an external css file\nLinking to an external css file\nCreating a navigation bar with HTML and styling it with CSS\n\n**Slide 121:** Web Design & Development\u000bWhat will we cover in these classes? What is ‘The Web’ and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nBuilding a Classwork Portfolio Website\nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 122:** Review: What did we cover in the last classes?\n\n**Slide 123:** What will we cover in this class? Using everything we have covered in the last 5 classes, we will build a website to store our work from this module and from the other modules in the CS Inc course.\n\nEach subject will have it’s own page and there will be a navigation bar linking them all.\n\nWe will also look at embedding code used in the Micro:Bit module within a webpage so that it appears as it would on a physical device.\n\n**Slide 124:** What will we cover in this class? The work completed during this lesson will act as Task 1.\n\nUsing a second external style sheet, Task 2 will be to style the website completely differently to how we style it during this lesson. \nNote: You are encouraged to style it to your own liking and be as adventurous as you want.\n\nTask 3 will be to add a CV page to the website containing information about you and your experience.\n\n**Slide 125:** Set up a new Repl session for the task Open www.repl.it\nClick Log In\nEnter username and password\nClick Log In\n\nClick New Repl in the top right of the screen\n\n\nSelect HTML, CSS, JS as language\n\nName the Repl session as “Class 6 Portfolio Website”\nClick Create Repl\n\n**Slide 126:** Building a Portfolio Website - Planning How many pages does our website require?\nHomepage\nPython\nWeb Design & Development\nMicro:Bit\nIntro to Computer Science\n\nWhat elements will the pages require?\nNav\nBody\nHeadings\nParagraphs\nImages\n\nWhat resources will each page be displaying?\nText\nCode\nImages This list will vary, depending on the modules you have completed in your school or centre\n\n**Slide 127:** Setting up the project We need to add additional HTML files to cover the pages required. This will vary depending on the modules that you have completed in your school or centre\npython.html\nwebdev.html\ncompsci.html\nmicrobit.html\n\nWe also need to add an Images folder.\nimages\n\n**Slide 128:** Homepage If we get the nav bar set up first in the index.html file, then we can copy the code and paste it in to the other pages to use as the starting point.\n\nAdd a <nav> section.\nAdd anchor links within it.\nThe links should point to each HTML file.\nThis ensures that we can reach any page of the website, from any page of the website.\n\n<body>\n  <script src=\"script.js\"></script>\n  <nav>\n    <a href=\"index.html\">Home</a>   \n    <a href=\"compsci.html\">Computer Science</a>\n    <a href=\"microbit.html\">Micro:Bit</a>\n    <a href=\"python.html\">Python</a>\n    <a href=\"webdev.html\">Web Development</a>\n  </nav>\n</body> This code is available on Moodle if you want to copy it into index.html\n\n**Slide 129:** Homepage Before we copy the base code to the other pages, let’s apply some basic styling.\n\nWe’ll stick with a light blue background and grey navigation bar as in the other tasks\nnav {\n  background-color: grey;\n}\nnav a {\n  float: top;\n  color: #f2f2f2;\n  text-align: center;\n  padding: 14px 16px;\n  text-decoration: none;\n  font-size: 18px;\n}\nnav a:hover {\n  background-color: #ddd;\n  color: black;\n}\nbody {\n  background-color: lightblue;\n} This code is available on Moodle if you want to copy it into style.css\n\n**Slide 130:** Webpages Copy the code from index.html and paste it into each of the other HTML files.\n\nClick Run and you should be able to click on each link and reach that page.\n\nIf you encounter any errors, check the spelling and look out for capital letters where there shouldn’t be any.\n\nWe also need the CS Inc logo to appear on the pages so move the .jpeg file into the images folder now.\n\n**Slide 131:** Homepage Add an image, headings and two paragraphs to the index.html page\nImage - CS Inc logo\nHeading 1 – “CS Inc Website Portfolio”\nHeading 3 – “Your Name”\nParagraph – “I have built this website to showcase the work I have completed during the CS Inc modules. I have learned programming in Python, Web Design and Development, programming a Micro:Bit and received an Introduction to Computer Science.”\nParagraph – “You will find some of the tasks I have completed on each page. I hope you enjoy what you see.”\n\n**Slide 132:** Homepage In the style.css external style sheet, add styling to each new element\n\nimg {\nwidth: 100%\n}\n\nh1 {\n  color:navy;\n  text-align: center;\n}\n\u000bh3 {\n  color: navy;\n  text-align:center;\n}\n\u000bp { \n  color: navy;\n}\n\n**Slide 133:** Building the individual lesson pages The next step is to fill each lesson page with content detailing all you have accomplished.\n Note: Don’t use the text in these slides. You should add as much information about all you have learned as you can.\n\nTo do this we need to add HTML elements to each module page documenting what you have learned.\n\nYou can add more entries to the external style sheet or use inline styling if required to style the pages as you want.\n \nYou should outline some of the tasks you have completed and insert some images.\nHint: Perhaps show a before (start of the task) and after (when it is complete).\n\nAs an example, we will work on the Micro:Bit webpage and look at embedding code within a webpage so you can demonstrate your work from that class.\n\n**Slide 134:** Building the individual lesson pages Click on the microbit.html file in Repl\n\nAdd in some text detailing what you have learned and completed throughout the module.\n\nThe code below is a sample.\n\n<h2>\n  Micro:Bit\n</h2>\n<p> \n  In this module we learned how to program a Micro:Bit device to produce a physical response to our coding using the lights and sounds available on it.\n</p>\n\n**Slide 135:** Embedding code Next, we will use a new tag to embed the code used in the Micro:Bit module into our webpage.\n\nYou can export one of your own Micro:Bit tasks or follow the steps below to embed the code.\n\nBelow the <p> elements you just entered, enter the code below:\n\n<p>\n  In our Web Design & Development we learned how to embed code within a webpage and you can see a task we completed on our Micro:Bit embedded into the webpage here.\n</p>\n\n**Slide 136:** Embedding code Next, we will use a new tag to embed the code used in the Micro:Bit module into our webpage.\n\nYou can export one of your own Micro:Bit tasks or follow the steps below to embed the code.\n\nOpen up one of your Micro:Bit projects.\nClick on Share\nClick on Publish Project\n\n**Slide 137:** Embedding code Click on Embed\nClick on Simulator\nHighlight and Copy all of the code that appears in the next screen (or click on Copy button)\n\n**Slide 138:** Embedding code Click on Embed.\nClick on Simulator.\nHighlight and Copy all of the code that appears in the next screen (or click on Copy button).\nOpen up the microbit.html page in Repl and paste the code into the body section below your text.\n\nClick Run and click on the link for the Micro:Bit page in the nav bar.\n\nYou should see the webpage load like the image on the next slide.\n\nIt should be fully interactable, showing off the code you created in action\n\n**Slide 139:** Micro:Bit embedded on the webpage\n\n**Slide 140:** Embedding code If you didn’t add a h2 element to the style.css file when you loaded the page and saw that it was different to the rest of the text, do so now.\n\nYou can have it appear like the h1 or h3 elements or you can try something new.\n\nh2 {\n   color: navy;\n   text-align: left;\n}\n\nA completed example is shown on the next slide. Please continue to add content in the same way to the Web Design & Development, Python and Computer Science module pages.\nText\nImages\nWhatever you like.\n\n**Slide 141:** Completed Homepage & Micro:Bit page\n\n**Slide 142:** Summary You have now seen how to set up a website with separate webpages for each of the modules you are completing in your school or centre\n\nYou can now complete your website by updating the other webpages to give details of what you have learned\n\n**Slide 144:** Web Design & Development\u000bWhat will we cover in these classes? What is ‘The Web’ and how does it work?\nThe Internet. World Wide Web. Client / Server relationships\nHow are websites made?\nIntro to HTML\nHTML\nThe language of the web\nCSS\nStyling websites\nBuilding a Classwork Portfolio Website. \nBootstrap\nAnother method to style websites\nAssessment Class 1 Classes 2 & 3 Classes 4 & 5 Class 6 Class 7 Class 8\n\n**Slide 145:** Review: \u000bWhat did we cover in the classes so far?\n\n**Slide 146:** What will we cover in this class? Bootstrap\nWhat is it?\nPros & Cons\nHow do we use it?\nWhat does it look like?\n\nHow to implement Bootstrap\n\nUsing Bootstrap\nGrid\nColours\nButtons\nHamburger Nav Bar\n\n**Slide 147:** Bootstrap – What is it? Bootstrap is a free and Open-Source CSS framework.\n\nIt is aimed at ‘mobile – first’ front end web development.\n\nIt was originally developed in 2011 by Mark Otto and Jacob Thornton in Twitter to promote consistency across the internal tools used in Twitter\n\nMark Otto:\n\n\n\n\n\n\nIt has since spread further than the Twitter offices and is used on 21% of all websites, including the likes of Netflix.com\nhttps://w3techs.com/technologies/details/js-bootstrap#:~:text=Bootstrap%20is%20used%20by%2027.0,an%20extensive%20Bootstrap%20market%20report “A super small group of developers and I got together to design and build a new internal tool and saw an opportunity to do something more. Through that process, we saw ourselves build something much more substantial than another internal tool. Months later, we ended up with an early version of Bootstrap as a way to document and share common design patterns and assets within the company.”\n\n**Slide 148:** Bootstrap – Pros & Cons Pros\nIt’s free.\nWill ensure uniformity in design.\nAllows for easy development of responsive websites.\nPromotes mobile-first, responsive, development.\n\n\nCons\nYour website design will appear similar to hundreds of thousands (possibly millions) of other websites.\nThere is some difference in how things are named compared to CSS so it is not as easy to jump into using.\n\n**Slide 149:** Bootstrap – How do we use it? To implement Bootstrap CSS styling in our website we just need to link to the Bootstrap CSS Stylesheet. This is done in the same way as we have done in previous classes.\n\nWe will include the link shown below in our HTML document. \n\n Note: This link is saved in a text file on moodle and you can copy and paste it when you need it <link rel=\"stylesheet\" href=\"https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css\" integrity=\"sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T\" crossorigin=\"anonymous\">\n\n**Slide 150:** Bootstrap – Some things to know The logic in how we applied CSS to our HTML documents will transfer over to Bootstrap. \n\nWe will use ‘inline styling’ for this class and style specific aspects of the webpages as we want. External stylesheets can also be used.\n\nHowever, the names of buttons, page sections and colours in Bootstrap are different to what we have encountered so far. \n\nLet’s look at what some examples can look like before we start using it.\n\n**Slide 151:** Sample Webpage styled with Bootstrap Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 152:** Another Webpage styled with Bootstrap Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 153:** Another Webpage styled with Bootstrap Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 154:** Bootstrap – The Grid One notable difference in the Bootstrap framework to CSS is the Grid. It is the basis on which the entire page layout is created.\nEach page is made up of rows. You can have as many rows on the page as you want or need.\nEach row is made up columns. The combined column width per row is 12.\n   Note: You can have fewer than 12. You can’t have more!\n\nThe examples below shows the layout of these 3 rows\nThe first has one column of width 8 and a second column of width 4 \t(8 + 4 = 12)\nThe second has three columns of width 4 \t\t\t\t(4 + 4 + 4 = 12)\nThe third has one column of width 6 and a second column of width 6\t(6 + 6 = 12) Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 155:** Bootstrap – The Grid If we look at our examples from the previous slides, you can see how they are made up of rows and columns\n\n\n\n\n\n\n\n\n\n\n\nTwo rows\nFirst row – One column\nSecond row – Three columns\n\nGoing further into detail on this is out of the scope of this class but it is useful to bear in mind when arranging your pages. Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 156:** Bootstrap – Responsive Design Let’s look at responsive design in action.\n\nOpen www.repl.it\nClick Log In\nEnter username and password\nClick Log In\nClick on the + on the top right of the screen\nSelect HTML, CSS, JS as language\nName the Repl session as “Class 7 Test”\nClick Create Repl\n\n**Slide 157:** Bootstrap – Responsive Design Add the Bootstrap stylesheet URL to the <head> element of your index.html document\n<link rel=\"stylesheet“ href=\"https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css\" integrity=\"sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T\" crossorigin=\"anonymous\">\n\nThe code below is available on moodle. Copy and paste it into your <body> section\n<div class=\"row\">​\n\t<div class=\"col-md-3\">First column</div>​\n\t<div class=\"col-md-3\">Second column</div>​\n\t<div class=\"col-md-3\">Third column</div>​\n\t<div class=\"col-md-3\">Fourth column</div>​\n</div>​\n\n<div class=\"row\">​\n\t<div class=\"col-xs-12 col-md-3\">.col-xs-12 .col-md-3</div>​\n\t<div class=\"col-xs-12 col-md-3\">.col-xs-12 .col-md-3</div>​\n\t<div class=\"col-xs-12 col-md-3\">.col-xs-12 .col-md-3</div>​\n\t<div class=\"col-xs-12 col-md-3\">.col-xs-12 .col-md-3</div>​\n</div>​\nClick Run\n\nMove the column to the right to make the preview window smaller and see what happens.\n\n**Slide 158:** Bootstrap – Responsive Design Before:\t\t\t\t\t    After:\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe can see that on devices with smaller screens (phones & tablets) or when browser windows are made smaller, the content on the page is moved accordingly so that it is always presented to the user and nothing is pushed out of view.\n\n**Slide 159:** Bootstrap – Colours I’m sure you could all name these colours, right? Let’s see if you and Bootstrap agree.\n\n**Slide 160:** Bootstrap – Colours Were you right? bg-warning bg-primary bg-success bg-info bg-danger bg-secondary bg-dark As you can see, it is not simply a case of typing in green, yellow or red.\n   Note: The bg- in each section refers to the ‘background’.\n\nThe rest of the text refers to the colour you wish to use.\n\nYou can refer to the Bootstrap cheatsheet in Moodle if you find yourself forgetting that green = success when completing the tasks\n\n**Slide 161:** Bootstrap – Buttons Bootstrap buttons are an easy way to bring some nice design to your website. \nThey can be used to turn a plain hyperlink into an eye catching button to help attract the user’s attention.\nThe code below is available on Moodle. Copy and paste it into the <body> section of Class 7 Test session below the grid code if you wish to try this out.\n<h2>Button Styles</h2>\n  <button type=\"button\" class=\"btn\">Basic</button>\n  <button type=\"button\" class=\"btn btn-primary\">Primary</button>\n  <button type=\"button\" class=\"btn btn-secondary\">Secondary</button>\n  <button type=\"button\" class=\"btn btn-success\">Success</button>\n  <button type=\"button\" class=\"btn btn-info\">Info</button>\n  <button type=\"button\" class=\"btn btn-warning\">Warning</button>\n  <button type=\"button\" class=\"btn btn-danger\">Danger</button>\n  <button type=\"button\" class=\"btn btn-dark\">Dark</button>\n</h2>\n\nClick Run and you should see the following in the preview pane:\n\n**Slide 162:** Bootstrap – Hamburger Nav Bar Bootstrap allows us to also change the appearance of our nav bars as another useful way to bring some nice design to your website. \n\nThey can be used to condense the nav bar options on smaller screen into a list which appears when the Hamburger menu icon is clicked or tapped.\n\nThe code on the next page is available on Moodle. Use it to replace all of the code in the Class 7 Test Repl session.\n\nClick Run and you should see the image shown after the code.\n\n**Slide 163:** Bootstrap – Hamburger Nav Bar\n\n**Slide 164:** Bootstrap – Hamburger Nav Bar Webpage is expanded enough to show the full nav bar.\nReduce the size of the screen.\nSee what happens to the nav bar.\n\n**Slide 165:** Bootstrap – Hamburger Nav Bar When the webpage is reduced in size, the full nav bar links disappear and the menu button appears.\nWhen we click on the menu button, we can see the links appear.\n\n**Slide 166:** Bootstrap Now that we know what Bootstrap looks like, let’s use it on some of our webpages by completing some of the Tasks on Moodle.\n\n\nRefer to the Bootstrap ‘Cheat Sheet’ on Moodle at any point if you need it and check out the resources at w3schools.com at the link below for a deeper look into what Bootstrap can offer you.\n\n\nhttps://www.w3schools.com/bootstrap4/default.asp\n\n**Slide 167:** Summary You are now familiar with\n\n\nWhat bootstrap is and it's Pros and Cons\n\nHow to include the bootstrap stylesheet in your HTML\n\nHow to use the bootstrap stylesheet to produce responsive design for your web pages\n\n**Slide 170:** Bootstrap – The Grid Each page is made up of rows. You can have as many rows on the page as you want or need.\nEach row is made up columns. The combined column width per row is 12.\nYou can have less than 12. \nYou can’t have more.\n\nThe examples below show 3 rows\nThe first has one column of width 8 and a second column of width 4 \t(8 + 4 = 12)\nThe second has three columns of width 4 \t\t\t\t(4 + 4 + 4 = 12)\nThe third has one column of width 6 and a second column of width 6\t(6 + 6 = 12) Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 171:** Bootstrap – The Grid If we look at our examples from the previous slides, you can see how they are made up of rows and columns\n\n\n\n\n\n\n\n\n\n\n\nTwo rows\nFirst row – One column\nSecond row – Three columns\n\nGoing further into detail on this is out of the scope of this class but it is useful to bear in mind when arranging your pages. Credit: https://www.taniarascia.com/what-is-bootstrap-and-how-do-i-use-it/\n\n**Slide 172:** Bootstrap – Responsive Columns Add the Bootstrap stylesheet URL to the index.html document\n<link rel=\"stylesheet“ href=\"https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css\" integrity=\"sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T\" crossorigin=\"anonymous\">\n\nColumn sizes per device type.\n<div class=\"row\">\n\t<div class=\"col-\">Devices < 576px (Smaller SmartPhones)</div>\n\t<div class=\"col-sm\">Devices >= 576px (SmartPhones)</div>\n\t<div class=\"col-md\">Devices >= 768px (Tablets)</div>\n\t<div class=\"col-lg\">Devices >= 992px (Laptops)</div>\n\t<div class=\"col-xl”>Devices >= 1200px (Desktops)</div>\n</div>\n\n**Slide 173:** Bootstrap – How to reference elements Element:                     Code:                                                                                                                Example:\n\n\nRows:\t     <div class=“row”>\n\nColumns:      <div class=“col”>\n\n\nButtons:        <button type=“button” class=“btn btn-warning”>Warning</button>\n\n\nBackground: <div class=“p-2 mb-2 bg-success text-white”> .bg-success</div>\n\n\nText:               <p class=“text-primary”>.text-primary</p>\n\n**Slide 174:** Bootstrap – Colours bg-warning bg-primary bg-success bg-info bg-danger bg-secondary bg-dark\n\n**Slide 175:** Bootstrap – Cards <div class=\"card\">\n  <img class=\"card-img-top\" src=\"/images/pathToYourImage.png/jpg\" alt=“Alternate Text For Image\">\n  <div class=\"card-body\">\n  <h4 class=\"card-title\">Card title</h4>\n    <p class=\"card-text\">\n      Some quick example text to build on the card title\nand make up the bulk of the card's content.\n    </p>\n    <a href=\"#\" class=\"btn btn-primary\">You can define a link to bring you somewhere if required</a>\n  </div>\n</div>\n\n**Slide 176:** Bootstrap – Buttons Bootstrap buttons are an easy way to bring some nice design to your website. \nThey can be used to turn a plain hyperlink into an eye catching button to help attract the user’s attention.\nCopy the code below and paste it into the <body> section of the Task 1 Repl session below the grid code.\n<h2>Button Styles</h2>\n  <button type=\"button\" class=\"btn\">Basic</button>\n  <button type=\"button\" class=\"btn btn-primary\">Primary</button>\n  <button type=\"button\" class=\"btn btn-secondary\">Secondary</button>\n  <button type=\"button\" class=\"btn btn-success\">Success</button>\n  <button type=\"button\" class=\"btn btn-info\">Info</button>\n  <button type=\"button\" class=\"btn btn-warning\">Warning</button>\n  <button type=\"button\" class=\"btn btn-danger\">Danger</button>\n button type=\"button\" class=\"btn btn-dark\">Dark</button>\n</h2>\n\n**Slide 177:** Bootstrap – Hamburger Nav Bar - Template <!DOCTYPE html>\n<html>\n  <head>\n    <meta charset=\"utf-8\">\n    <meta name=\"viewport\" content=\"width=device-width\">\n    <title>Class 7 - Bootstrap</title>\n    <link rel=\"stylesheet\" href=\"https://maxcdn.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css\">\n  </head>\n  <body>\n    <nav class=\"navbar navbar-expand-md bg-dark navbar-dark\">\n      <!-- Brand -->\n      <a class=\"navbar-brand\" href=\"#\">Navbar</a>\n      <!-- Toggler/collapsibe Button -->\n      <button class=\"navbar-toggler\" type=\"button\" data-toggle=\"collapse\" data-target=\"#collapsibleNavbar\">\n        <span class=\"navbar-toggler-icon\"></span>\n      </button>\n      <!-- Navbar links -->\n      <div class=\"collapse navbar-collapse\" id=\"collapsibleNavbar\">\n        <ul class=\"navbar-nav\">\n        <li class=\"nav-item\">\n          <a class=\"nav-link\" href=\"#\">Link 1</a>\n        </li>\n        <li class=\"nav-item\">\n          <a class=\"nav-link\" href=\"#\">Link 2</a>\n        </li>\n        <li class=\"nav-item\">\n          <a class=\"nav-link\" href=\"#\">Link 3</a>\n        </li>\n        </ul>\n      </div>\n    </nav>\n\n    <script src=\"https://ajax.googleapis.com/ajax/libs/jquery/3.5.1/jquery.min.js\"></script>\n    <script src=\"https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.16.0/umd/popper.min.js\"></script>\n    <script src=\"https://maxcdn.bootstrapcdn.com/bootstrap/4.5.2/js/bootstrap.min.js\"></script> \n  </body>\n</html>\n\n**Slide 178:** Bootstrap – Useful Links https://www.w3schools.com/bootstrap4/default.asp\n\nhttps://hackerthemes.com/bootstrap-cheatsheet/\n\nhttps://bootstrapcreative.com/resources/bootstrap-4-css-classes-index/",
          "file": "Notes/21 - HTML & CSS.pptx"
        },
        {
          "id": "22",
          "title": "Introduction to databases",
          "content": "**Slide 1:** Introduction to databases Computer Science Leaving Cert\n\n**Slide 2:** Lesson Objectives Students will learn about:\nThe difference between structured data and unstructured data\nThe database and its structure\nThe relational database and its advantage over a flat-file database\nHow entities (or tables) are related to each other in a relational database. 2\n\n**Slide 3:** Content 1.\n\n**Slide 4:** What is a database? A database is an organised collection of data, that allows users to access and search the information easily. 4\n\n**Slide 5:** Advantages of using database Databases are better storage techniques compared to file systems. \nMany users can access the data at the same time.\nDatabases can hold very large amounts of data.\nThe data is only stored once and, hence, data duplication is avoided. \nThe data is consistent as the changes need to be made only once. These changes are then reflected for all the users using the database.\nThe data is stored in an organised way, which makes it easier and faster to carry out searches of the data\nDatabases can interact with many different types of systems e.g. phone apps, web pages, business software 5\n\n**Slide 6:** 6\n\n**Slide 7:** Flat File Database (the simplest) The simplest form of database is called a flat file. An example is a .csv file\nA flat file  database contains only a single table. For example: contact details, product details, etc. A table is a collection of related data and is made up of rows and columns. \nEach row represents a record in the database. A record holds specific items of data about someone of something 7\n\n**Slide 8:** Structure of a table: Example 8\n\n**Slide 9:** Flat File Database (the simplest) In a database table, an attribute refers to a column name and the data that it contains\n\n\n\nThe term record is used to refer to one entry (or row) in the database. Each record contains various fields 9\n\n**Slide 10:** Database Data Types Each attribute in the database table contains a specific type of data, just like python variable types (string, Boolean, integer, float)\nVarchar -> the first attribute in our table below contains a string. In database terminology, a string is called a varchar. \nNumber -> The attributes labelled phoneNum and age contain numbers. These are of datatype number. \nDate -> The attribute labelled DOB contain the data type date. 10\n\n**Slide 11:** Creating a database (flat file) 11\n\n**Slide 12:** Appending records to the CSV file 12\n\n**Slide 13:** Read and Display records from the CSV file 13\n\n**Slide 14:** Structured vs. unstructured data Unstructured data\nInformation that is not structured in a predefined manner is called unstructured data. \nData in a word document or notepad are examples of unstructured data. Structured data\nInformation that is stored in a predefined manner, that is, in a structure is called structured data.\n Databases help us to store data in a structured manner. 14\n\n**Slide 15:** 15\n\n**Slide 16:** Issues with single table of data The table contains details of patients’ record in a doctor’s clinic. If we were to build a database system for a doctor’s clinic, you will need to cross-reference by doctor as well as patient. \nEach doctor has many patients, but each patient normally has only one doctor\nNotice the duplication of data for the doctors in the below file. 16\n\n**Slide 17:** Issues with single table of data Notice the duplication of data for the doctors in the below file. This causes problems such as:\nWasted time/effort when entering and updating the data. Every occurrence of the doctor attributes will need to be updated if a detail changes e.g doctor retires or changes jobs.\nWasted storage space as duplicated data takes up extra memory space 17\n\n**Slide 18:** What is a relational database? A relational database is a type of database that is structured  and is distributed over various tables that are connected using a relationship in a relational database. Hence, no redundant data. 18\n\n**Slide 19:** Use or two or more related tables\u000b - Relational Database It is better practice to split this information into 2 tables. Then define a relationship between the table\nA patient’s table\nA Doctor’s table 19 Patient’s Table Doctor’s Table\n\n**Slide 20:** Primary key The purpose of a primary key is to provide a unique key to a record.\nTo prevent data duplication, each record uses a primary key field, which must be unique. It can be automatically generated. \nA primary key may be just numbers or a combination of letters and numbers. \nIn the employee table, an employee number is unique for each employee and serves as the primary key. 20\n\n**Slide 21:** Use or two or more related tables\u000b - Relational Database First, need to create a PRIMARY KEY for Each patient record and each doctor record 21 Patient’s Table Doctor’s Table\n\n**Slide 22:** Relational Database – The Foreign Key In the patient’s table a new attribute (column) is added called  doctorID. This creates the link (relationship) back to the doctor’s table. This is the FOREIGN KEY and it is always the primary key from the other table with which you want to make the link 22 Patient’s Table Doctor’s Table\n\n**Slide 23:** Relational database\nA large set of data is distributed over various tables and connected using a relationship in a relational database. Hence, no redundant data.  \nA relational database is efficient over flat-file databases as it is more efficient and takes up less space in memory. Flat-file database\nPresence of redundant data, that is, repetition of data in a database.\nDue to the presence of redundant data, more memory space is required and it is also less efficient. 23 Relational databases vs. Flat file databases\n\n**Slide 24:** Advantages of using a relational database For example, a library may store information such as a book list, member list, department, book location, research paper list, staff details and many more. \nStoring these details in a single flat-file system would lead to more memory space requirement and data redundancy. 24\n\n**Slide 25:** Characteristics of relational database An entity is an object in a system for which the information is stored. \nA characteristic of an entity is its attribute. \nIn a record, attributes about an entity are stored. \nFor example, let us consider a book as an entity. \nAuthor, name of the publisher, year of publication, price of the book, and ISBN number are its attributes. 25\n\n**Slide 26:** Characteristics of relational database In a relational database, each table contains information about just one entity. \nEach table has a primary key and these tables are linked together using these primary keys and foreign keys. \nForeign keys are a link to primary keys. 26\n\n**Slide 27:** Characteristics of relational database: Example Let us consider the database of a library with three tables:\nBook with a primary key BookID \nMember with primary key MemberID\nBookslent with foreign keys Book ID and Member ID 27\n\n**Slide 28:** Characteristics of relational database: Example The entity descriptions for the entities book and member are given as:\nBook (BookID, Title, Author, Publisher)\nMember(MemberID, FirstName, LastName, ValidUntil, PhoneNumber)\nThe primary key is underlined in entity descriptions. 28\n\n**Slide 29:** 29 Book:\n\n**Slide 30:** 30 Member:\n\n**Slide 31:** 31 Bookslent table: It can be noticed that other attributes of books and members are not included, as these are referenced using their respective IDs.\nBook ID and Member ID are the foreign keys of this table that act as a reference to other tables. These foreign keys also act as primary key for this table.\n\n**Slide 32:** Referential integrity Referential integrity ensures that all foreign keys represent a valid and existing primary key in its parent table. \nFor example: In Books table, if you delete the record for BookID=2, it will create an orphaned record (shown in red colour) in Bookslent table. 32\n\n**Slide 33:** Relationship between entities (tables) Entities(table) are related to each other using one of the following relationships:\nOne to one\nOne to many\nMany to many 33\n\n**Slide 34:** Relationship between entities: One to one One entity is related to another entity only. For example: A person has one email address. 34 Person Email iD Course 3 Student 3 has\n\n**Slide 35:** Relationship between entities: One to many One entity is related to many entities. For example: A library has many members. 35 Library Member has\n\n**Slide 36:** Relationship between entities: Many to many Many entities are related to many entities. For example: Many students can take a course and a course can have many students. 36\n\n**Slide 37:** Let’s review some concepts Database\nA database is an organised collection of data, which allows users to obtain and process information according to their requirements. Structure of a database\nData in a database is stored in the form of tables. Table\nA table consists of various records. Each record consists of several fields. 37 Relational database\nA relational database is a type of database that is structured and allows users to identify and access data which is in relation to other data. Entity\nAn entity is an object in a system for which the information is stored. In a relational database, each table contains information about just one entity. Attribute\nA characteristic of an entity is its attribute. In a record, attributes about an entity are stored.\n\n**Slide 38:** Activity 2.\n\n**Slide 39:** Activity-1\u000bDuration: 20 minutes An online airline ticket-booking websites process the customer’s request, shows available flight details with price and prompts the user to select one of them, books the tickets and sends a copy of the ticket to the customer’s email address.\nIdentify the entities(tables) in the above scenario.\nWhat relationship exists between these entities? Draw flowcharts to explain your answer. 39\n\n**Slide 40:** Activity-1\u000bDuration: 20 minutes What tables do you require for an online airline ticket booking website? Show the attributes of all entities. Mark the primary keys and foreign keys (if any) of each table. Show the relationship between tables as a flowchart. 40\n\n**Slide 41:** End of topic questions 3.\n\n**Slide 42:** End of topic questions What is a database? What are the advantages of using a database?\nWhat are the applications of the database?\nHow is a database structured?\nWhat is a relational database? What are its advantages over a flat-file database?\nWhat I meant by the term entity, record and attributes? How are these represented in the form of a table? 42\n\n**Slide 43:** End of topic questions What is the difference between a primary key and foreign key?\nWhat are the different relationship between entities? Give examples for each relationship with entity-relationship diagrams. 43\n\n**Slide 44:** End of topic questions A car dealer builds a database for the following entities:\nCustomer (CustomerID, FirstName, LastName, PhoneNumber)\nCar (ProductCode, Brand, Model, Price)\nOrder (CustomerID, ProductCode, Accessories, TotalPrice)\nDraw the entity relationship diagrams between these entities.\nWhat is the primary key for the Order table? \nWhat is referential integrity? In this database, how is referential integrity maintained? 44",
          "file": "Notes/22 - Introduction to databases.pptx"
        },
        {
          "id": "27",
          "title": "WWW, Internet &Protocols",
          "content": "**Slide 1:** WWW, Internet &Protocols 6th yr Computer Science\n... (content truncated for brevity) ...\nAI can be used for bad purposes, like fake videos (deepfakes), hacking, or spreading lies.",
          "file": "Notes/18 - Data Analytics.pptx"
        }
      ]
    }
  ]
}
